Pandas Intermediate to Advance

What's covered?
Combining Data From Multiple Tables using pd.merge() Function
how argument
Learning with Two Example DataFrame
Applying Inner Join
Applying Left Join
Applying Right Join
Applying Outer Join
Applying Cross Join
Brief primer on merge methods (relational algebra)
Solving a Case Study by Joining Multiple Tables
Reading .csv Files - customer_data.csv, product_data.csv and purchase_data.csv
Joining Purchase Table with Customer and Product Table
Generating Basic Reports on the Data
Visual Data Analysis using Pandas (Plotting)
Reading .csv File - Iris Data
Histogram Plot
KDE Plot
Box Plot
Vertical and Horizontal Bar Plot
Scatter Plot
Combining Data From Multiple Tables using pd.merge() Function
pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.

pandas provides a single function, merge(), as the entry point for all standard database join operations between DataFrame or named Series objects:


Question: How to combine data from multiple tables?
Answer: Multiple tables can be concatenated both column wise and row wise as database-like join/merge operations are provided to combine multiple tables of data.

Remember

Multiple tables can be concatenated both column-wise and row-wise using the concat function.
For database-like merging/joining of tables, use the merge function.

Syntax
pd.merge(left, right, how='inner', on=None)

In [1]:
import pandas as pd 
import numpy as np

In [2]:
left = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"], 
                     "A": ["A0", "A1", "A2", "A3"], 
                     "B": ["B0", "B1", "B2", "B3"]
                    })
print(type(left))
left

<class 'pandas.core.frame.DataFrame'>

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [3]:
right = pd.DataFrame({"key": ["K0", "K1", "K2", "K3"], 
                      "C": ["C0", "C1", "C2", "C3"], 
                      "D": ["D0", "D1", "D2", "D3"]
                     })

right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [4]:
result = pd.merge(left,right, on='key')
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

how argument
The how argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or right tables, the values in the joined table will be NA. Here is a summary of the how options and their SQL equivalent names:

Merge method (how) |	SQL Join Name|	Description	|Important Pointer|

inner	INNER JOIN	Use intersection of keys from both frames	Display matching records from both tables
left	LEFT OUTER JOIN	Use keys from left frame only	Display all records from the left table and matching records from the right table
right	RIGHT OUTER JOIN	Use keys from right frame only	Display all records from the right table and matching records from the left table
outer	FULL OUTER JOIN	Use union of keys from both frames	Keep all the records from both tables
cross	CROSS JOIN	Create the cartesian product of rows of both frames	Cartesian Product

Learning with Two Example DataFrame
Let's consider the two dataframes given below and apply all merge operations:

In [33]:
left = pd.DataFrame({"key1": ["K0", "K0", "K1", "K2"], 
                     "key2": ["K0", "K1", "K0", "K1"], 
                     "A": ["A0", "A1", "A2", "A3"], 
                     "B": ["B0", "B1", "B2", "B3"]
                    })

left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [34]:
right = pd.DataFrame({"key1": ["K0", "K1", "K1", "K2"], 
                      "key2": ["K0", "K0", "K0", "K0"], 
                      "C": ["C0", "C1", "C2", "C3"], 
                      "D": ["D0", "D1", "D2", "D3"]
                     })

right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [35]:
result = pd.merge(left,right, on=['key1','key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [36]:
result = pd.merge(left, right, how="inner", on=["key1", "key2"])

result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [30]:
a = pd.DataFrame({
    'key1': ['a','b','c','d'],
    'key2' :['b','c','d','e'],
    'id': [1,2,3,4],
    'id2': [4,5,6,7]
})
a

  key1 key2  id  id2
0    a    b   1    4
1    b    c   2    5
2    c    d   3    6
3    d    e   4    7

In [31]:
b = pd.DataFrame({
    'key1': ['a','b','c','d'],
    'key2' :['b','c','d','e'],
    'id': [4,5,6,7],
    'id2': [1,2,3,4],
})
b

  key1 key2  id  id2
0    a    b   4    1
1    b    c   5    2
2    c    d   6    3
3    d    e   7    4

In [32]:
c = pd.merge(a,b, how='inner', on=['key1','key2'])
c

  key1 key2  id_x  id2_x  id_y  id2_y
0    a    b     1      4     4      1
1    b    c     2      5     5      2
2    c    d     3      6     6      3
3    d    e     4      7     7      4

Applying left join

In [37]:
result = pd.merge(left, right, how="left", on=["key1", "key2"])

result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Applying right join

In [38]:
result = pd.merge(left, right, how="right", on=["key1", "key2"])

result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

Applying outer join

In [39]:
result = pd.merge(left, right, how="outer", on=["key1", "key2"])

result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

Applying Cross join
create the cartesian product of rows of both frames

In [41]:
result = pd.merge(left, right, how="cross")

result

   key1_x key2_x   A   B key1_y key2_y   C   D
0      K0     K0  A0  B0     K0     K0  C0  D0
1      K0     K0  A0  B0     K1     K0  C1  D1
2      K0     K0  A0  B0     K1     K0  C2  D2
3      K0     K0  A0  B0     K2     K0  C3  D3
4      K0     K1  A1  B1     K0     K0  C0  D0
5      K0     K1  A1  B1     K1     K0  C1  D1
6      K0     K1  A1  B1     K1     K0  C2  D2
7      K0     K1  A1  B1     K2     K0  C3  D3
8      K1     K0  A2  B2     K0     K0  C0  D0
9      K1     K0  A2  B2     K1     K0  C1  D1
10     K1     K0  A2  B2     K1     K0  C2  D2
11     K1     K0  A2  B2     K2     K0  C3  D3
12     K2     K1  A3  B3     K0     K0  C0  D0
13     K2     K1  A3  B3     K1     K0  C1  D1
14     K2     K1  A3  B3     K1     K0  C2  D2
15     K2     K1  A3  B3     K2     K0  C3  D3

Brief primer on merge methods (relational algebra)
Experienced users of relational databases like SQL will be familiar with the terminology used to describe join operations between two SQL-table like structures (DataFrame objects). There are several cases to consider which are very important to understand:

one-to-one joins: for example when joining two DataFrame objects on their indexes (which must contain unique values).
many-to-one joins: for example when joining an index (unique) to one or more columns in a different DataFrame.
many-to-many joins: joining columns on columns.
It is worth spending some time understanding the result of the many-to-many join case. In SQL / standard relational algebra, if a key combination appears more than once in both tables, the resulting table will have the Cartesian product of the associated data.

Solving a Case Study with merge()
Reading .csv Files - customer_data.csv, product_data.csv and purchase_data.csv

Joining Purchase Table, Customer and Product Table

Generating Basic Reports on the Data

Visual Data Analysis using Pandas (Plotting)
Syntax
DataFrame.plot(kind = "kind")

The kind of plot to produce:

line : line plot (default)
bar : vertical bar plot
barh : horizontal bar plot
hist : histogram
box : boxplot
kde : Kernel Density Estimation plot
density : same as ‘kde’
area : area plot
pie : pie plot
scatter : scatter plot
hexbin : hexbin plot